[
  {
    "url": "https://blog.tokemak.xyz/post/community-call-april-3-2024",
    "title": "Tokemak Blog - Community Call - April 3, 2024",
    "content": "Guarded Launch Roadmap Update: The Autopilot guarded launch is progressing well, with rebalances performing as expected through various test scenarios. $AURA is planned to be integrated as an incentive token as early as next week to enable the upcoming integration of Balancer and Aura destinations. A reminder that the performance metrics during this phase may not fully reflect the eventual capability of Autopilot due to the limited and forced nature of the testing scenarios.\nTesting Pools Expansion: Preparations are underway to support a broader range of tokens by expanding pricing sources through Redstone and Chainlink oracles. This expansion will enable support for most tokens relevant to liquid staking and restaking on EigenLayer.\nDevelopment and Security Testing: The project is currently engaged with Hexens for a comprehensive system audit, with a public announcement expected soon. This rigorous auditing process, involves a significantly larger engineering team than the standard model.\nNew Features: New additions to the UI will soon be launched including; a Zap in/out feature and the transition of the rebalancing history to an activity feed based on user feedback. A team page will also be added to tokemak.xyz\n\n‍",
    "metadata": {},
    "scraped_at": "2025-10-15T21:13:46Z"
  },
  {
    "url": "https://blog.tokemak.xyz/post/community-call---february-22-2024",
    "title": "Tokemak Blog - Community Call - February 22, 2024",
    "content": "Imminent Guarded Launch: The Autopilot guarded launch is fast approaching, with updates to be shared on Discord and Twitter. The strategy for deploying protocol-owned-assets during the guarded launch is to observe the integrity of the system; it will then shift to focusing on performance at open launch.\nInitial Testing Pools: The launch will start with a limited set of pools, focusing destinations on Curve, Balancer, Aura, and Maverick. Liquid Staking Tokens that are expected to be live at guarded launch include stETH, wstETH, cbETH and rETH.\nDevelopment and Security Testing: Current development status involves rigorous testing, including audits and partnerships with testing platforms like TestMachine AI.\n‍New Features and Systems: Introduction of Autopilot as a new way to provide liquidity, connecting and rebalancing across various DEXs and pools. The first autoETH pool will focus on a basket of LSTs, followed by LRTs. Autopilots modular design enables it to easily integrate new destinations and assets.\nExpansion and New Tokenomics: Plans include quick expansion to Layer 2 solutions and the integration of new assets and destinations to optimize over for better yields. New tokenomics to be released offer an improved liquidity directing mechanism that enables TOKE stakers to receive Autopool specific rewards as well as boost the yield on their LP positions.\nMarketing Strategy: The new design language aims to evolve the Tokemak universe along with product expansions. A significant launch campaign is planned that includes various strategies from video content to podcast and media coverage, with community involvement encouraged during the launch week to accompany an incentives campaign planned for the public launch.\n\n‍",
    "metadata": {},
    "scraped_at": "2025-10-15T21:13:52Z"
  },
  {
    "url": "https://blog.tokemak.xyz/post/auto-finance",
    "title": "Tokemak Blog - Auto Finance",
    "content": "Tokemak is now Auto Finance \n\nA year ago Tokemak reinvented itself as Tokemak Autopilot, or Autopilot for short, the first fully automated liquidity manager. Autopilot aggregates core DeFi primitives into autopools, which optimize yield for LPs and provide a 24/7 responsive source of liquidity for DeFi protocols.  Autopilot gives users a simple approach to access and optimize all forms of yield available to DeFi, including decentralised exchanges, money markets, yield marketplaces, US Treasuries, and funding rates. We sourced and consolidated TVL into one of the largest and best performing LPs in DeFi. \n\n‍\n\nA year after the launch of Autopilot, we are in a very strong position.  Tokemak now has over $130M in assets under management (AUM) across 12 autopools, demonstrating clear product market fit.  Our TVL is comprised of ETH and stablecoins which are at work in the autopools, currently yielding up to 16.4% on stablecoins and 4.2% on ETH.\n\n‍\n\nTokemak’s treasury is currently valued at ~$30M as of the time of this article.  As it stands, this treasury value is higher than the current fully diluted value of the TOKE token.  A buyback program is in place to purchase TOKE using protocol revenue, as well as TOKE purchased using some of the accrued altcoins held in our treasury.  \n\n‍\n\nTokemak's vision of becoming the core liquidity infrastructure for DeFi is now a reality, and the brand must evolve with our platform's evolution. Our efforts are now unified under the banner of Auto Finance.\n\n‍\n\nAuto Finance\n\nAuto Finance directly describes what we do: automate onchain finance. Specifically, it reflects a commitment to developing fully automated liquidity solutions for individual and institutional users alike.The brand enables a cohesive parent identity that evokes what we do and will unify all future product lines under development.\n\n‍\n\nExpanding our portfolio of products\n\n‍\n\nAs DeFi and fintech converge, we are evolving to meet the needs of institutional and non crypto-native users, expanding our addressable market and available TVL. Within Auto Finance, we are actively working on the following product lines:\n\n‍\n\nAuto Pools\n\nCore automated vault infrastructure for seamless liquidity management\nAuto Pro\n\nInstitutional arm, a tailored product offering for professional investors. This enables autopools to be whitelabeled for exchanges, custodians, and funds\nAuto App (working title)\n\nMobile app with integrated fiat on/off-ramps and a simplified UX for easy access to Auto Finance products.  Users can simply connect their bank accounts and access AUTO yields, without the complexity of DeFi\nAuto Token\n\nTOKE will migrate 1:1 into AUTO in the near future.  AUTO holders are eligible for protocol revenues and governance over the protocol.\nNew Yield Product\n\nUpcoming stealth product with details TBA.\n\n‍\n\nAuto Finance’s autopools remain available for use today at tokemak.xyz, with a pop up to greet users and communicate the rebrand for some time.  Auto Pro is open to exchanges, custodians, funds, and other institutions today – reach out at institutions@auto.finance if you’re interested in automated yield for your ETH or stablecoin holdings.  The Auto App and AUTO token will both be launching very soon.\n\n‍\n\nTOKE migration to new AUTO token\n\n‍\n\nThe protocol token of Tokemak has always been TOKE and, for now, the protocol token of Auto Finance remains TOKE.  In the near future Auto Finance will be consolidating value across all product lines under a single token: AUTO. \n\n‍\n\nKey details of the AUTO token include:\n\n1:1 Migration: TOKE tokens will transition to AUTO at a 1:1 ratio, ensuring a seamless process for holders.\nUnified Ecosystem: AUTO will be tied to all AUTO products and consolidate all accrued value.\nProtocol Revenues: AUTO earns revenues generated from the protocol.  Today, TOKE also earns revenue before it migrates to AUTO.  Therefore, AUTO (and TOKE at this moment in time) gives holders exposure to DeFi yields generated across decentralised exchanges, money markets, US Treasuries, and funding rates.  Current TOKE holders that stake through the site are earning up to 18% APR.  Additional buybacks of TOKE will be commencing imminently, with a portion of the treasury used to buy TOKE.\n\nIMPORTANT: AUTO is not yet launched. Any current AUTO tokens including potential newly created ones are not ours. Trust that we will be very loud when our AUTO token debuts. The launch date of the AUTO token will be announced first on our social channels (discord.gg/tokemak and https://x.com/autopools), with advanced notice.  If you see any other AUTO tokens launching before that, they are NOT affiliated with us, and additionally could be scams. Always check your URLs and your transaction details to protect yourself from phishing attempts.\n\n‍\n\nIf you wish to have exposure to Auto Finance in the interim, holding TOKE is the way to do it, as TOKE will seamlessly migrate into AUTO in the near future. Again, 1 TOKE = 1 AUTO post-migration. There will be a simple, streamlined process for TOKE holders to migrate their tokens into AUTO at a 1:1 rate upon launch of AUTO.\n\n‍\n\nNew Link Tree\n\n‍\n\nUsers can now follow Auto Finance on Twitter/ X with the handle @autopools .  Starting in 1 week, Auto Finance will be hosted at www.auto.finance.  If you’re used to going to tokemak.xyz - fear not, it will always continue to redirect to auto.finance.  \n\n‍\n\nThe new Linktree and nomenclature use 'Auto Finance' as the umbrella term for all products and consolidate the Tokemak Autopilot dApp into the term that captures the most user mindshare: ‘Auto Pools’.\n\n‍\n\nNext Steps\n\nAuto Finance will share many announcements soon, with the releases of new product lines and the AUTO token launch and migration planned soon in 2025. Stay tuned for product and governance details!",
    "metadata": {
      "read_time": "3 min read time"
    },
    "scraped_at": "2025-10-15T21:13:57Z"
  },
  {
    "url": "https://blog.tokemak.xyz/post/autopilot-guarded-launch-announcement",
    "title": "Tokemak Blog - Autopilot - Guarded Launch Announcement",
    "content": "Intro\n\nThe birth of Autopilot has arrived, beginning with a “guarded launch” to ensure the security and integrity of the system. During this phase, only Tokemak treasury assets will be deployed through Autopilot. Once the system has been sufficiently validated, it will open for external deposits. Please read below for more information regarding what to expect from the guarded launch, as well as how to participate:\n\nTokemak v2 – Autopilot\n\nAutopilot represents a new way to LP, automatically optimizing deployments of your ETH by rebalancing across a known set of trusted DEXs and stable-pools, auto-compounding your rewards and saving gas costs.\n\nAutopilot is designed with the goal of continuously allocating an LP portfolio for long-term outperformance. This is achieved with the following key features:\n\n\n\nComposite Return Metric: Autopilot input;\nRebalance Constraint: Gatekeeper for Rebalances;\nAdaptive Rebalance Constraint: Self-learning control;\nSolver: Off-chain component responsible for Rebalances;\n\n\nThe Composite Return Metric is a score associated with each destination integrated on Autopilot. This metric breaks down APRs into separate parts. As such, Autopilot has the flexibility of overweighting/underweighting different components for further optimization.\n\nAdditionally, the rebalance constraint is a gatekeeping condition for rebalances, which states that the expected return over the cost offset period needs to exceed the rebalance cost. It is worth noting that this is a self-learning mechanism with a variable cost offset period that adapts to different market environments.\n\nLastly, rebalances are handled by the Solver. This intent-based architecture has an off-chain component where solvers can propose rebalance solutions to the Autopilot contract, while an on-chain component checks if the proposed solution constitutes an improvement and does not violate imposed constraints.\n\nThe Guarded Phase\n\nThe guarded phase precedes Autopilot’s open public launch. Although ETH yield optimization is a primary objective of Autopilot, the guarded phase focuses on testing and safety above yield optimization. Its objective is to validate the integrity of the system and rebalancing logic as outlined here.\n\nThe guarded phase supports the core Autopilot functionality intended to be supported at the open launch. At the same time it restricts aspects of the system to enable Tokemak to test under specific conditions.\n\nDuring the guarded phase Tokemak will be the only depositor into the Guarded Autopool. Based on the reaching successful checkpoints, the initial ETH deposit will be scaled up.\n\nAssets, DEXs and DEX pools will also initially be limited, and will be expanded over the course of the guarded phase. Reference here for current checkpoints and expansions. By the end of the guarded phase the system is intended to reflect the full set of features, assets, DEXs and pools by Autopools at open launch.\n\nAutopilot will undergo two additional audits in parallel with the guarded phase. Audits will include an additional full-system audit, in order to maintain Tokemak's rigorous security standards.\n\nParticipating in the Guarded Phase (locking TOKE)\n\nTokemak v2 will introduce redesigned tokenomics tailored to its functionality. Meanwhile, TOKE holders, current Liquidity Directors and accTOKE holders can engage in the guarded launch by either migrating and/or locking their TOKE tokens.\n\nLocked TOKE will commence earning rewards on Wednesday, March 6, 2024. autoETH rewards are calculated based on the system earnings of the previous week and are distributed retroactively. Therefore, the first rewards will begin accruing on Wednesday, March 13, 2024. In contrast to accTOKE, for which rewards were distributed in one lump sum, the autoETH rewards drip out linearly over the duration of the week. Since rewards are earned in the preceding week, this also implies that users who withdraw TOKE will continue to receive rewards due to them.\n\nPlease note that users will be able to withdraw their rewards after the guarded phase has been completed and the system is opened up.\n\nFind below a breakdown of the steps for the different types of holders:\n\n\naccTOKE holders:\n\nCurrent accTOKE holders, referring to TOKE that was locked into accTOKE before the rollover on Wednesday, February 28, 2024, do not need to migrate. They will seamlessly start earning autoETH rewards on Wednesday, March 6, 2024. If you do not wish to partake, please withdraw your TOKE.\n\nLiquidity Directors:\n\nCurrently staked TOKE has to be migrated in order to partake. The mechanics follow the logic of the existing system, meaning a user has to be locked for a full cycle before earning rewards. LD reward emissions will end on March 6th, meaning that LDs that wish to partake in the guarded phase need to migrate by March 5th, in order to be included in the following week of rewards. Please note that LDs were always subject to missing a cycle of rewards when moving over to accTOKE. If you do not wish to partake, please withdraw your TOKE.\n\n\nTo migrate your TOKE, use the “MIGRATE DEPOSITED TOKE” option in the accTOKE module:\n\nLiquid TOKE holders:\n\nTo earn autoETH rewards, lock your TOKE. Remember, after your TOKE is locked into accTOKE, rewards are earned retroactively (for the prior week), and your TOKE must remain locked for a full cycle.\n\n‍",
    "metadata": {
      "read_time": "4 min read"
    },
    "scraped_at": "2025-10-15T21:14:02Z"
  },
  {
    "url": "https://blog.tokemak.xyz/post/autopilot-launch-and-roadmap",
    "title": "Tokemak Blog - Tokemak Community Update: Autopilot Launch and Roadmap",
    "content": "Tokemak Community Update: Autopilot Launch and Roadmap\n\n‍\n\nTokemak Autopilot launches this coming Monday, September 16th.\n\nAfter a thorough security review process, Tokemak is now ready to transition from its current guarded launch phase to an open launch for external LPs.\n\n‍\n\n1. Autopilot: A New Way to LP\n\nTokemak developed Autopilot to introduce automated liquidity to DeFi. As a novel LP aggregation primitive, Autopilot monitors and autonomously routes liquidity across eligible LP destinations. This is achieved through configurable Autopools (ERC-4626), which represent option sets of eligible destinations for liquidity rebalances. As a result, Autopool LPs receive passive and optimal returns that, over the long term, outperform all constituent pools. These returns are then auto-compounded into the respective Autopool.\n\nAdditionally, LPs remain composable with DeFi through LATs (Liquid Auto Tokens), the Autopool's yield-bearing receipt tokens. In summary, Autopools are automated liquidity networks tokenized through LATs.\n\n‍\n\n2. Autopools: Live at Launch\n\nAutopilot will launch with 3 core ETH-denominated Autopools:\n\nautoETH - Autopool configured with ETH LST LP positions deployed across integrated DEXs\nautoLRT - Autopool configured with ETH LRT LP positions deployed across integrated DEXs. This specific Autopool accounts for points using implied rates from yield markets to optimally rebalance liquidity\nbalETH - Autopool developed in partnership with Balancer, which rebalances LPs exclusively across Balancer pools. This custom deployment highlights the configurable nature of Autopools and its value proposition to streamline liquidity across DeFi protocols with extensive user bases\n\n‍\n\n‍\n\n3. Post-launch Roadmap\n\nAs an LP aggregator, Autopilot has a long roadmap of integrations and expansion opportunities to fulfill. Beyond the expansion to additional integrated assets and DEXs, the following items are an integral part of this process.\n\n‍\n\n3.1. Layer 2\n\nShortly after the mainnet launch, Autopilot's open launch will go live on Base, with baseETH as its flagship Autopool. This deployment is already active in the current guarded launch phase. The goal is to establish a strong presence in the Base ecosystem early on, as we believe it to be the L2 with the greatest growth potential. The L2 expansion will then proceed to Arbitrum and other OP stack L2s, prioritized based on addressable markets and potential partnerships.\n\n‍\n\n3.2. New Assets - USD Autopools\n\nUSD Autopools will be the second type of market supported on Autopilot, catering to the needs of USD stablecoin LPs. This large addressable market presents a major expansion opportunity for Tokemak.\n\n‍\n\n3.3. Permissionless Autopools\n\nAutopilot’s architecture will enable permissionless Autopool deployments. Instead of joining pre-configured Autopools, LPs will have the ability to select desired liquidity destinations among existing integrations, thereby creating customized risk profiles. Beyond individual users, this opens opportunities for specialized third parties, such as risk managers, to use Autopilot as a platform to launch Autopools.\n\n‍\n\n3.4. Tokenomics v1.5\n\nThe existing accTOKE model will be upgraded to sTOKE, and will introduce a new form of token utility. Users will be able to:\n\nVote TOKE to Autopools\nEarn rewards generated by Autopools based on voting choices\n\nMore details about this upgrade will be released in the coming weeks.\n\n‍\n\n3.5. Cross-chain Rebalancing\n\nTokemak is developing a proof of concept (POC) that leverages ZK coprocessors to enable cross-chain liquidity rebalancing. This technology, currently in its R&D stage, will allow Autopilot to reach its LP aggregation endgame and position Tokemak as a pioneer in applying ZK coprocessors to DeFi use cases.\n\n‍\n\n4. Security Review Process\n\nA secure architecture and protocol design are defined from the start, with the codebase rigorously tested through unit, integration, and fuzz tests, as well as internal reviews. The following summarizes the comprehensive security review process that Tokemak underwent, along with ongoing security best practices.\n\nFull system audit with Hexens\nCrowd competition audit with Sherlock\nFormal verification with Certora, paired with a crowd-sourced audit curated by Hats Finance\nBug bounty programs with Immunefi and Remedy\nReal-time monitoring with Hypernative\n\nA more comprehensive review of Autopilot’s security approach is set to be released post-launch, providing both users and the wider community with a detailed overview of Tokemak’s security procedures.\n\n‍\n\n‍\n\n5. Final Remarks\n\nA long development cycle comes to a close, but ahead of us lies an expansive roadmap with a singular vision: delivering automated liquidity to DeFi. We want to extend our gratitude to the Tokemak community who supported this vision along the way. Together with you, we aim to fulfill the ambition that inspired Autopilot’s creation.\n\n‍\n\nIf you’d like to learn more about Autopilot, we encourage you to read our blog post, which offers a complete overview of the system: https://blog.tokemak.xyz/post/autopilot\n\n‍\n\nMain site: https://www.tokemak.xyz/\n\nFollow us on X: https://x.com/TokemakXYZ\n\nJoin our community here: https://discord.gg/tokemak\n\n‍",
    "metadata": {
      "read_time": "3 min read time"
    },
    "scraped_at": "2025-10-15T21:14:08Z"
  },
  {
    "url": "https://blog.tokemak.xyz/post/community-call---september-27-2024",
    "title": "Tokemak Blog - Community Call - September 27, 2024",
    "content": "Discord Security: A security incident on Discord was quickly addressed. The server owner account was not compromised, and additional security measures are being implemented to prevent future occurrences.\n\nAutopilot Launch: Autopilot has exceeded expectations, reaching nearly $31 million in Total Value Locked (TVL) across the three Autopools in less than two weeks since launch.\n\nBase Deployment: Autopilot on Base chain is scheduled for deployment next week, with a warm-up period before going fully live to the public. As part of the Base deployment a new DEX, Aerodrome, will also be integrated.\n\nTokenomics Update: New tokenomics are coming soon, allowing users to vote their TOKE tokens to specific Autopools and earn receipt tokens of that Autopool as rewards.\n\nStablecoin Expansion: The team is focusing on USD-denominated Autopools (autoUSD) as the next major area for expansion.\n\nPodcast Feature: A podcast featuring the team is set to release early next week on The Edge Pod.\n\nTemporary NAV fluctuations: The team explained that temporary fluctuations in Net Asset Value (NAV) below 1 are due to bootstrapping costs and will stabilize as yield accrues.\n\nIncentives Campaign: The incentives campaign is being reviewed on a monthly basis, based on Inflows and LP behavior. Any changes to this will be announced in Discord.\n\nBalancer Integration: A new pool on Balancer pairing balETH with wstETH is being created with incentives expected in October. This marks the first DeFi integration using an Autopool receipt token.\n\nNFT Mint: A snapshot for an upcoming NFT mint will be taken on September 30th for users in the pools.\n\nFuture Outlook: The team emphasized that this is just the beginning, with plans to expand and continuously improve the protocol, including targeting USD denominated Autopools to increase attractiveness throughout market cycles.\n\n‍\n\nStay tuned for more updates and thank you for your continued support!\n\n┻┳\n\n‍",
    "metadata": {
      "read_time": "2 min read time"
    },
    "scraped_at": "2025-10-15T21:14:14Z"
  },
  {
    "url": "https://blog.tokemak.xyz/post/baseusd",
    "title": "Tokemak Blog - baseUSD",
    "content": "baseUSD is now live\n\n‍\n\nThe first stablecoin Autopool on Base, basedUSD aggregates and automates your liquidity across the following destinations:\n\n‍\n\nIntegrated Lending Protocols:\n\n• Aave\n\n• Morpholabs\n\n• 0xFluid\n\n• Eulerfinance\n\n‍\n\nIntegrated DEXs:\n\n• AerodromeFi\n\n• CurveFinance\n\n• Balancer\n\n‍\n\nPlanned Integrations:\n\n• Pendle (integration in progress, to be added upon completion)\n\n‍\n\nAs always, this Autopool is designed with:\n\n• Autonomous rebalancing without multisigs\n\n• Liquid positions with the ability to exit anytime\n\n• Integration with core DeFi primitives: lending, DEXs, and yield marketplaces\n\n• No manual intervention required\n\n‍\n\nCheck out the baseUSD Autopool here: https://app.tokemak.xyz/pools/baseUSD\n\n‍",
    "metadata": {
      "read_time": "2 min read time"
    },
    "scraped_at": "2025-10-15T21:14:19Z"
  },
  {
    "url": "https://blog.tokemak.xyz/post/validator-penalties-slashing-and-their-impact-on-tokemak-v2",
    "title": "Tokemak Blog - Validator Penalties, Slashing, and their impact on Tokemak V2",
    "content": "Background\n\nThis article aims to provide a firm understanding of penalty and slashing mechanisms, which are crucial in the Ethereum consensus layer. These mechanisms play a vital role in preserving network integrity and deterring malicious activities. Specifically, we will delve into the details of penalties and slashing and assess their potential implications for Tokemak v2, also considering various scenarios that have occurred in the past.\n\nPenalties and Slashing\n\nIn the Ethereum consensus layer, misbehavior is met with two forms of retribution: penalties and slashing. Below, we will explore the distinctions and some details of each of these mechanisms.\n\nPenalties\n\nEthereum utilizes penalties as a means to address non-malicious technical problems which can be outside of the validator’s control and not for possibly malicious attacks on the network.\n\nValidators are required to submit correct and timely attestations (containing their view of the target and source checkpoint of the chain) once per epoch (every 32 blocks, which is an equivalent of roughly 6.4 minutes). For example, in Epoch 209418 the target checkpoint was 6,701,407 and (block 17,518,997) and the source checkpoint was 6,701,376 (block 17,518,966).\n\nAfter a delay of 32 slots there starts to be penalties for late but correct attestations.\n\nMissing attestation can happen for reasons both inside and outside the validators control.\n\nPenalties are generally benign and small and are not expected to have a significant impact on the performance of an LST or Tokemak as a participant in the LST space.\n\n“Note that the attester does not have full control over whether it receives rewards or not. An attester may behave perfectly, but if the next block is skipped because the proposer is offline, then it will not receive the correct head block reward. Or if the next proposer happens to be on a minority fork, the attester will again forgo rewards. Or if the next proposer’s block is late and gets orphaned — subsequent proposers are supposed to pick up the orphaned attestations, but there can be considerable delays if block space is tight. There are countless failure modes outside the attester’s control.”\n\nSource: https://eth2book.info/capella/part2/incentives/rewards/\n\n‍\n\nSlashing\n\nSlashing is a more severe punishment that serves as a deterrent against malicious behavior within the Ethereum network and is applied when consensus rule violations occur that could indicate an attack on the network. Validators can be slashed for the below offenses, which are all treated the same:\n\n‍\n\n1. Related to Casper FFG consensus,\n\nMaking two differing attestations for the same target checkpoint, or\nMaking an attestation whose source and target votes “surround” those in another attestation from the same validator.\n\n2. Related to LMD GHOST consensus,\n\nProposing more than one distinct block at the same height, or\nAttesting to different head blocks, with the same source and target checkpoints\n\n‍\n\nWhen a validator is slashed, they lose 1 ETH in an initial penalty and are unable to earn rewards for approximately 36 days. Additionally, a correlation penalty is imposed around day 18, scaling with the number of validators slashed within a timeframe of approximately 18 days on either side of the slashing offense .\n\n‍\n\nSlashing Scenarios and their Impact on Tokemak v2\n\nDuring an incident on April 3, 2023, Flashbots was exploited, resulting in the drainage of $20M from multiple sandwich bots. In this particular case, a validator intentionally submitted an invalid block, including a bait transaction targeted at the sandwich bots. As a consequence, the validator faced slashing, losing 1 ETH. However, considering the substantial profits gained from exploiting the sandwich bots, which amounted to $20M, the validator deemed the slashing penalty to be a worthwhile trade-off.\n\nExternal Incentives Make Slashing Profitable\n\nThis type of slashing poses a minimal risk to Tokemak for several reasons:\n\nThe slashing incident affected only a single validator.\nThe slashed validator was not associated with an LST protocol.\nLarge-scale third-party exploits are generally infrequent.\nThe primary targets of such exploits are typically not the LST protocols themselves, but rather third parties, such as the sandwich bots that relied on Flashbots’ trust.\n\nConsidering these factors, the specific slashing incident described does not present a significant risk to Tokemak.\n\n‍\n\nNode Operator Unintentional Technical Mistake\n\nAccidental technical errors by LST node operators have been a primary cause of slashing events. These events typically arise from configuration errors or bugs specific to a single operator, rather than system-wide issues:\n\nOn April 13, 2023 a Lido Node Operator named RockLogic had 11 of their validators slashed. This was because of a bug where they accidentally had several nodes with duplicate validators keys.\nOn February 2, 2021 Staked had 75 of their validators slashed by accidently signing a single block twice. Because this was earlier in the beacon chain development the initial penalty for slashing was less at .25 ETH so they only lost 18 ETH to the slashing.\n\nMultiple safeguards are implemented to mitigate the occurrence of large-scale accidental slashing incidents resulting from minor bugs. In the aforementioned cases, the slashing of validators was attributed to configuration errors made by a single node operator, rather than a widespread system-wide bug. These safeguards play a crucial role in minimizing the likelihood of such incidents.\n\nLST protocols, along with Ethereum validators in general, strive to foster diversity among node operators and client software. This approach aims to mitigate the potential risk of a bug leading to simultaneous slashing of numerous validators. This is a report on the consensus layer client diversity of Lido in Q1 of 2023.\n\nOccasional accidental technical errors are not anticipated to have a substantial impact on slashing. Moreover, numerous protocols incorporate an additional layer of protection through an “insurance fund.” For instance, Lido has established its insurance fund, Rocket rETH, utilizes staked RPL as a form of insurance for each node to safeguard against significant slashing events. These measures provide an added level of security and mitigate the potential consequences of slashing incidents.\n\nThese inadvertent minor slashing events do not pose a significant risk to Tokemak due to several factors:\n\nThere is a high level of diversity among node operators, LST protocols, client software, and consensus software. This diversity reduces the likelihood of large-scale slashing events, making them relatively infrequent and limited in scope. Bugs are thus more likely to have a localized impact.\nAs of June 21, 2023, a total of 260 validators have been slashed, with 242 of those incidents attributed to “Attestation rule offense.” When a bug is detected, node operators can promptly and easily pause new attestations. This proactive response was the immediate action taken by both organizations during the significant slashing events mentioned above.\n\nConsidering these factors, the accidental occurrence of minor slashing events poses no serious threat to Tokemak’s operations and security.\n\n‍\n\nInactivity Leak\n\nIn the event where at least one-third of validators cease to submit attestations, the consensus layer becomes unable to finalize. Consequently, the offline validators will experience a gradual reduction in their balances until the effective balance of the online validators surpasses two-thirds of the total staked ETH.\n\nWhile it is true that such a scenario would pose a significant risk to Tokemak, it is important to highlight that the conditions necessary for LST protocols to encounter significant slashing resulting from an inability to meet attestation obligations, are exceedingly rare and would arise in extremely severe circumstances (such as global conflicts or comparable catastrophic events).\n\n‍\n\nCoordinated Massive Attack on the Network\n\nThe slashing mechanism is designed to impose smaller penalties in cases where it is not perceived as an attack on the network, while imposing more significant penalties in situations where it appears to be part of a coordinated attack. This mechanism incorporates the concept of the “correlation penalty.” If a substantial number of validators are slashed within a ~36 day period, they will all receive a heightened penalty that scales based on the proportion of validators slashed during that time frame.\n\nThere are a couple of ways in which this can occur. One possibility is if malicious actors gain control over a large LST, another scenario could arise if an unnoticed bug in a consensus layer client, such as Lighthouse, starts causing issues after being adopted by a substantial portion of node operators. These scenarios would pose a significant risk to Tokemak.\n\n‍\n\nConclusion\n\nThus far, no slashing events have occurred due to the correlation penalty. The instances of slashing that have taken place were minor and accidental, resulting from configuration errors or unfavorable incentives associated with MEV. Penalties arising from missed attestation votes are also minimal and can be attributed to random issues beyond the validators’ control.\n\nConsidering the diversity of LSTs, node operators, and software, it is unlikely that a technical error would significantly impact the required number of nodes for a consensus penalty.\n\nThe main slashing risk to Tokemak lies in holding an LST controlled by a malicious actor actively engaging in network attacks.",
    "metadata": {
      "read_time": "7 min read"
    },
    "scraped_at": "2025-10-15T21:14:24Z"
  },
  {
    "url": "https://blog.tokemak.xyz/post/the-stablecoin-autopool-autousd-is-now-live",
    "title": "Tokemak Blog - The Stablecoin Autopool: autoUSD is now Live",
    "content": "The first stablecoin Autopool, autoUSD, is now live on mainnet with incentives. Stable up with autoUSD.\n\n‍\n\nautoUSD\n\n‍\n\nUSD stablecoins have long offered a multitude of scalable yield sources in DeFI - lending, t-bills, funding rates, and LPing. However, depending upon market conditions, the optimal yield source can vary. Enter Autopilot for stablecoins: autoUSD\n\n‍\n\nautoUSD aggregates all scalable yield sources under a single product, powered by Autopilot.\n\n‍\n\nautoUSD's underlying liquidity is autonomously deployed across the following Ethereum mainnet destinations:\n\nLending protocols: Aave, Fluid, Morpho\nDEXs: Curve and Balancer\nYield-bearing stablecoins: sUSDe, sUSDS, sFRAX, and scrvUSD\n\n‍\n\n‍\n\nAs yields fluctuate across these integrated destinations, Autopilot will autonomously adjust the underlying collateral to ensure that LPs earn the best rates.\n\n‍\n\nautoUSD enables tokenized, autonomous liquidity that connects lending protocols, DEXs, and yield-bearing stablecoins. The autoUSD yield is the new blending rate for stablecoins across DeFi.\n\n‍\n\nCheck out the autoUSD Autopool, live now, here: https://app.tokemak.xyz/pools/autoUSD\n\n‍\n\n‍",
    "metadata": {
      "read_time": "2 min read time"
    },
    "scraped_at": "2025-10-15T21:14:29Z"
  },
  {
    "url": "https://blog.tokemak.xyz/post/community-call---july-24-2024",
    "title": "Tokemak Blog - Community Call - July 24, 2024",
    "content": "ETH CC: Several meetings with partner protocols took place at ETHCC last week. Feedback on Autopilot has been great as excitement builds toward the open launch. The panel recording will be shared as soon as it becomes available.\n\nAudit Update: Constant communication with Hexens is ongoing. There have been no issues found that would impact the schedule. The team is impressed with the level of depth and understanding Hexens is demonstrating with the code. The full system preliminary audit findings will be delivered to Tokemak next Friday (August 2nd). A follow-up audit for incremental code is planned, which is planned to be conducted in parallel with audit fixes.\n\nMarketing: A ramped approach is being implemented, with activity now increasing and a substantial amount of content in reserve. The team is eagerly anticipating the launch phase, which is looking to be an exciting period.\n\nbalETH: Announcement of the collaboration with Balancer to launch the balETH Autopool was shared on X/Twitter this week. It is currently in the proof of concept stage. By having their own Autopool, they are able to streamline their liquidity provision, not just for their current users but also by expanding the addressable market for liquidity providers to anyone that wants passive exposure to balETH itself. balETH will integrate multiple pool types, including metastable, gyroscope and concentrated liquidity, while providing a composable receipt token that the team is excited to integrate into DeFi.\n\n‍\n\nStay tuned for more updates and thank you for your continued support!\n\n┻┳\n\n‍",
    "metadata": {},
    "scraped_at": "2025-10-15T21:14:35Z"
  },
  {
    "url": "https://blog.tokemak.xyz/post/the-autopilots",
    "title": "Tokemak Blog - Introducing the Autopilots",
    "content": "Introducing: the Autopilots\nIt’s basically-free JPEG time. Mint is live for OGs on Base. Read more below: \n\n‍\n\nFrom the beginning the team has always made an effort to inject interesting aesthetics into our user experience and craft a universe around the protocol – with Autopilot we’re doubling down on this. \n\n‍\n\n“But why an NFT - they’re worthless rn?”        \n\n‍\n\nBecause we still think NFTs are cool, regardless of floor prices. The rise of NFTs was a massive amount of fun and an important addition to onchain culture, and participants in that era should be proud of their accomplishments. If nothing else NFTs brought hundreds of thousands of people onchain and that alone is a major contribution to Ethereum that no one can ever take away.\n\n‍\n\n‍\n\nSo here you go, come get your basically free, cool, commemorative and lore-based PFP. Equip it proudly to rep the Tokemak community, after all – DeFi and NFT culture are brothers.\n\n‍\n\nMint for OGs is live now at: autopilots.tokemak.xyz\n\n‍\n\nAutopilot (launching September 16th) is a useful tool for all ETH holders, especially those that may be mainly in the NFT world who aren’t keeping up with the latest opportunities for their ETH stack. Keeping track of DeFi has become a full time job, and Autopilot’s role as an LP aggregator is to automate that for everyone. \n\n‍\n\nRead more about Tokemak Autopilot here.\n\n‍\n\nWe’ve talked for a while about making a community NFT mint, but didn’t want to do it unless it was worthy of existence. Our new universe is a parable for Tokemak itself, you are the Autopilots and they are the protagonists, in the next ten days we will be revealing more about this world. We hope you like the NFTs, and who knows, maybe your Autopilot will be featured in one of our little videos down the road… \n\n‍\n\n‍\n\nMint details: \n\n‍\n\nThe mint (on Base) will happen in phases. Each phase will allow for up to 2 mints per category, per wallet. All mints are first come, first served. There will be a tiny 0.0003 ETH fee per mint, in addition to the extremely minimal gas costs on Base. \n\n‍\n\nPhase 1 - Visionary (143 Mints):\n\n‍\n\nOG $TOKE holders and $accTOKE stakers will be able to mint starting now. The snapshot for this phase was taken on 09.3.2024\n\n‍\n\nPhase 2 - Quickdraw (173 Mints): \n\n‍\n\nThis phase is for any depositors of any amount of ETH into one of the first Autopools (autoETH or autoLRT) at the launch of Autopilot (Sept 16th). The snapshot for depositors will be taken two weeks after launch (Sept 30th). \n\n‍\n\nPhase 3 - Certified Autopilot (183 Mints): \n\n‍\n\nDeposit at least 1 ETH into the autoETH or autoLRT pools after the launch of Autopilot. Snapshot will be taken two weeks after launch (Sept 30th). \n\n‍\n\nPhase 4 - Balancer (balETH Autopool - 70 Mints)\n\n‍\n\nDeposit any amount into the balETH Autopool. Snapshot will be two weeks after the launch of the balETH Autopool (launch date TBA soon). Mints are first come, first served after the snapshot.\n\n‍\n\nMore to come... \n\n‍\n\nWe tried to make the mint experience a unique one, so we hope you take the time to check it out, and if you miss the mint, you can always right click and save them. \n\n‍\n\nIf you have any issues, hop in our discord and we’re happy to help: https://discord.gg/tokemak\n\n‍\n\nMain site: https://www.tokemak.xyz/\n\n‍\n\nRead more about Tokemak Autopilot here: https://blog.tokemak.xyz/post/autopilot\n\n‍\n\nFollow us on X: https://x.com/TokemakXYZ\n\n‍\n\nUpdate - Official Opensea Collection link: https://opensea.io/collection/tokemak-autopilots\n\n‍\n\nClick the banner for vibes: \n\n‍",
    "metadata": {
      "read_time": "2 min read time"
    },
    "scraped_at": "2025-10-15T21:14:40Z"
  },
  {
    "url": "https://blog.tokemak.xyz/post/tokemak-v2-introducing-lmps-autopilot-and-the-dao-liquidity-marketplace",
    "title": "Tokemak Blog - Tokemak (v2): Introducing LMPs, Autopilot, and the DAO Liquidity Marketplace",
    "content": "Click here for an interactive tour of this illustration\n\n‍\n\nI. Intro (No tl;dr here, so strap in)\n\nDeFi has changed, and so has Tokemak. Iterating beyond the limitations that constrained v1, Tokemak v2 was developed as an improved system for both liquidity providers (LPs) and DAOs through a novel concept called Liquidity Management Pools (LMPs). The new system comprises two separate products: a dynamic pool allocator that optimizes returns for LPs across different pools and DEXs (Autopilot), and a liquidity order book that enables DAOs to rent liquidity according to a transparent market rate (DAO Liquidity Marketplace).\n\nTokemak v2 is comprised of both a dynamic LP optimizer and a transparent liquidity order book, facilitating a more symbiotic relationship between LPs and liquidity seekers.\n\n‍\n\nII. Background\n\nThe current status quo for DAOs to acquire liquidity relies on gauge systems that incentivize third-party LPs to provide liquidity to specific pools through periodic voting rounds. Using this mechanism, DAOs place incentives in voting markets at a fixed or market rate to influence voters to direct emissions to liquidity pools. Despite its merits, this strategy is subject to certain shortcomings, including an unknown depth of liquidity, a lack of flexibility for adjustments outside of voting rounds, and delayed responses to changes in liquidity needs.\n\nIn contrast, LPs face challenges in maintaining exposure to pegged assets (e.g., ETH LST pools), while optimally capturing the variance in yields across pools. Besides the complexity associated with the rebalancing logic of LP positions, this optimization process is prohibitively expensive for most DeFi users due to the inherently high gas costs.\n\nDAOs currently rely on voting rounds to incentivize liquidity providers, facing limitations in predictability, flexibility, and responsiveness. LPs struggle to balance exposure to LP pools and capture yield fluctuations due to complex rebalancing and high gas costs.\n\n‍\n\nIII. Tokemak v2: Introducing Autopilot and the Liquidity Marketplace\n\nTokemak v2 remains true to its original mission of providing DAO liquidity. This is achieved by addressing the aforementioned challenges through Liquidity Management Pools (LMPs) that support different assets across various DEXs. LMPs are the core building block of two products: the Autopilot and the Liquidity Marketplace. These products are specifically designed to provide DAOs with greater flexibility and deterministic control over liquidity, while optimizing and simplifying the complexity of liquidity provision for LPs.\n\nTake a tour of how the protocol works by clicking here.\n\nThe first addressable market for Tokemak v2 is focused on liquidity for ETH liquid staking tokens (LSTs). This approach provides a solution for LPs that seek a dynamic and optimal exposure to ETH through ETH LST pools, and it empowers LST protocols with new tools for liquidity management.\n\nTokemak v2 empowers DAOs and LPs with Liquidity Management Pools. The initial focus is on ETH liquid staking tokens, providing dynamic exposure to ETH for LPs and new liquidity management tools for LST protocols.\n\n‍\n\nIII(a). Autopilot\n\nTokemak’s Autopilot is an LP-centric utility that automatically rebalances liquidity across different assets, pools, and DEXs within a given LMP. With its dynamic allocation of liquidity, the Autopilot optimizes and auto-compounds LP returns, while simultaneously abstracting complexity away from the user and reducing gas costs.\n\nTo achieve this, the pool allocator logic considers several factors, including yields (i.e., base yield, trading fees, and incentives), exchange rate, underlying LST backing, slippage, and required liquidity constraints that enable the ability to exit any given pool. Additionally, the pool allocator logic verifies the on-chain LST backing and it accounts for the respective premium or discount while conducting liquidity rebalances to optimize its performance.\n\nClick here for an interactive version of the above illustration\n\nThrough this rebalancing mechanism, the liquidity supplied to Tokemak’s Autopilot reacts to external inputs and captures the variability in yields across different pools. It does so according to a step size and a lookback window. The speed of response to this step size is slower for external inputs and faster for internal inputs provided by the DAO facing product. As such, the Autopilot is a rational market participant, and its rebalancing algorithm defines Tokemak’s Liquidity Rate, reflecting the changes in external market dynamics.\n\nTo optimize the Autopilot’s routing, the pool allocator relies on a solver. The solver can be decentralized by competing off-chain solvers providing an optimal routing solution. An on-chain component then checks if the proposed solution constitutes an improvement and ensures that it does not violate imposed constraints.\n\nThe LMPs will utilize the ERC-4626 Standard, enabling seamless integration without requiring the development of custom adapters.\n\nIn addition to its value proposition for LPs, the Autopilot can be seen as an instrument that sustainably sources liquidity that is readily available to be allocated to the DAO Liquidity Marketplace. Regardless of fluctuations in liquidity demand from DAOs, all liquidity supplied to the Autopilot is actively deployed and thus designed to generate optimal returns for LPs and fees for the protocol.\n\nTokemak’s Autopilot simplifies LPs’ experience by automatically rebalancing liquidity across assets, pools, and DEXs and abstracting complexity away on a simplified dashboard. It optimizes returns by considering various factors and reacting to market dynamics, while the protocol generates fees and ensures sustainable liquidity sourcing — independent of direct DAO demand.\n\nA simplified presentation of the initial backtesting was shared during the last community call and can be found here: https://youtu.be/-kPIC3hd-lc?t=533\n\n‍\n\nIII(b). DAO Liquidity Marketplace\n\nThe Liquidity Marketplace is a novel approach to liquidity management for DAOs that enables real-time liquidity rental from any given LMP according to a transparent liquidity rate. This rate is determined by market dynamics that define the output liquidity rate discovered by the Autopilot (rebalancing logic).\n\nOne of the characteristics intrinsic to this product is the ability of DAOs to acquire liquidity directly and in quasi real-time while skipping indirect incentive mechanisms. As a result, Tokemak’s Liquidity Marketplace constitutes a system through which buyers can bid for liquidity at the current liquidity rate. The rebalancing logic treats these bids as internal and prioritized inputs.\n\nIt is worth noting that rates are sensitive to the supply and demand associated with this product, meaning that the liquidity rate increases when demand is high, and decreases when supply is high. Although buyers might place bids at any rate, the rebalancing logic will only provide liquidity once the bid is above Tokemak’s liquidity rate which represents the market price for liquidity rental. That is to say, the Liquidity Marketplace has a floor rate that is equal to the liquidity rate.\n\nWhile using this system, LST protocols are able to select a destination across different DEXs, select the desired depth, and deposit incentives to acquire liquidity at Tokemak’s rate in real-time. Such flexibility is particularly relevant for LST protocols to reinforce liquidity during events of on-chain liquidations and large validator exit queues. Furthermore, this ensures that buyers pay exclusively for liquidity that is allocated to them instead of overpaying through traditional indirect incentive mechanisms that result in an unknown depth of liquidity.\n\nLiquidity Marketplace, Tokemak’s DAO facing product, revolutionizes liquidity management by enabling quasi real-time liquidity rental at a transparent rate. Protocols bid for liquidity directly, skipping indirect incentives, while gaining flexibility, minimizing guesswork and reliance on often inelastic liquidity.\n\n‍\n\nIV. Tokenomics\n\nTokemak v2 represents a new chapter for TOKE tokenomics. The proposed model is still subject to changes pending future validation and data collected during the initial phase of the LMP launch. Conceptually, this token design enables users to stake TOKE as collateral for LMPs according to individual risk preferences. In return, stakers receive LMP-specific performance fees for potential slashing risks.\n\n‍\n\nIV(a). Core Mechanics\n\nIn this model, TOKE can be staked as collateral to Tokemak LMPs to provide a backstop against losses of principal. Token holders staking TOKE in a given LMP receive LMP-specific performance fees denominated in the underlying asset in exchange for potential slashing risks.\n\nGiven that different LMPs have different risk profiles, each staker must decide their exposure according to individual risk preferences. TOKE stakers can therefore improve the perceived safety of LMPs for LPs, thus attracting more deposits. This preserves TOKE’s utility of liquidity direction. At equilibrium, the APRs for TOKE stakers reflect the perceived risk associated with each LMP.\n\n‍\n\nIV(b). Slashing Events\n\nThe initial scope for Tokemak LMPs lies in liquidity for LSTs, and impermanent loss risks are modest when compared to volatile pairs. Post-Shanghai upgrade, the risk of severe and sustained depegs also becomes less likely due to the arbitrage of LSTs that trade at a discount versus their backing.\n\nOnce the LMP-specific losses reported from the respective oracle hit a predefined threshold and the payout condition is triggered, the backing asset is removed from the corresponding LMP backing and placed into a vesting contract. As the asset is moved into vesting, the staking yield associated with the respective LMP increases. This creates stabilizing market dynamics for the protocol during slashing events where the backing asset is moved into vesting, thus being removed from circulation. These mechanics ensure that the backing asset is not immediately liquidated, but rather vests over time.\n\nFurthermore, the backing asset is subject to a cooldown period to prevent stakers from removing funds from the respective LMP once the threshold for losses is triggered.\n\nThe steps below summarize the aforementioned slashing dynamics:\n\nOracle reports back losses, the threshold is met, and payout condition is triggered;\nBacking asset (TOKE) is removed from the LMP backing and placed into vesting;\nThe LMP backing APR increases therefore incentivizing token holders to stake;\nTOKE vests according to the predefined curve and duration.\n\nThe currently proposed token mechanics, pending validation, allow TOKE holders to stake tokens as collateral for Liquidity Management Pools. In return, stakers receive fees from the specific LMP. This incentivizes stakers to back LMPs based on risk profiles and TVL. Slashing events are handled through a vesting contract. Tokemak v2’s new tokenomics increase TOKE’s utility and reward token holders for participating in the protocol.\n\n‍\n\nIV(c). TOKE Meta-LMP\n\nAs Tokemak establishes multiple LMPs with different assets and pools, TOKE stakers gain access to a range of LMP-specific yield opportunities. As such, leveraging the Autopilot’s modular design, a TOKE LMP which optimizes returns for stakers seeking to rebalance their TOKE across different LMPs can be created.\n\nGiven that staking rewards are denominated in the underlying asset (e.g., TOKE holders staked to ETH LMPs earn ETH), the TOKE LMP rewards can be automatically converted to TOKE and compounded. As a result, TOKE stakers have a passive way to engage with Tokemak v2’s utility.\n\nNote: The general model outlined has tradeoffs in terms of both complexity and slashing risks for TOKE stakers. Due to this, there is an alternative proposal under consideration that still provides TOKE utility for both token holders and Tokemak LPs. The core difference of the alternative model lies in the absence of slashing risks for TOKE stakers, enabling a smoother integration of the TOKE LMP.\n\n‍\n\nV. Product Rollout and Expansion Strategy\n\nTokemak v2 will be subject to a sequenced release, Autopilot being the first product to launch, followed by the DAO Liquidity Marketplace. This release sequence is necessary to sustainably bootstrap TVL using the Autopilot. Once sufficient TVL is reached, it can be efficiently allocated to the DAO facing product according to the existing demand for liquidity.\n\nWhile the initial roll-out will be focused on pegged asset pools for ETH LMPs, Tokemak v2 aims to expand its product offering to stablecoins, additional stable pools, and lastly volatile pairs. It is worth noting that establishing liquidity rates for ETH and stablecoins constitutes a priority for v2, mirroring the demand for a dynamic and optimal exposure to these major asset classes.\n\nTokemak’s Autopilot is an ever evolving product. In addition to expanding the addressable market, more destinations for liquidity also benefit LPs, as the Autopilot gains more options for optimization. This not only refers to adding asset classes and destinations on mainnet (Balancer, Curve and Maverick at launch) — but also swiftly expanding to multiple L2s (Arbitrum, Optimism and zkSync) and their native DEXs (e.g. Velodrome).\n\nTokemak v2 will have a sequenced release, starting with the Autopilot and followed by the DAO Liquidity Marketplace. The focus is initially on ETH liquidity on the mainnet DEXs Balancer, Curve, and Maverick, with plans to expand to additional destinations and asset classes. Deployment on multiple L2s (Arbitrum, Optimism and zkSync) and their native DEXs are part of the near-term roadmap.\n\n‍\n\nVI. Conclusion\n\nThe overarching goal for Tokemak v2 is to introduce transparent liquidity rates to DeFi through Liquidity Management Pools (LMPs) that provide improved solutions for both LPs and DAOs. This is achieved through two core products: the Autopilot, which dynamically optimizes returns for LPs across a range of assets, and DEXs, and the Liquidity Marketplace, which enables DAOs to access liquidity in quasi real-time at a transparent rate.\n\nCreating a new dichotomy between static and dynamic options for LPs, the Autopilot autonomously rebalances liquidity across different venues, therefore outperforming a single pool exposure over time. Focusing on the first addressable market for v2, which is liquidity for ETH liquid staking tokens (LSTs), LPs that want exposure to ETH can capture the fluctuation in yields from different pools in a passive manner. As a result, LPs earn optimized returns on ETH while abstracting away complexity and minimizing gas costs.\n\nTo achieve this purpose, the Autopilot relies on several inputs, such as the various types of yield, the underlying LST backing, slippage, and liquidity constraints that ensure the ability to exit any given pool. Furthermore, the pool allocator logic verifies the on-chain LST backing, and it accounts for the respective premium or discount while conducting liquidity rebalances to optimize its performance.\n\nBy virtue of its adaptable nature and modular architecture, the addition of new destinations for liquidity continuously improves the Autopilot’s value proposition. Rather than being viewed as competition, high yielding opportunities can serve as catalysts for the Autopilot’s evolution.\n\nDespite the utilitarian emphasis from the LP’s perspective, the Autopilot serves another core purpose for Tokemak v2, which is to find the liquidity rate associated with a given LMP, and sustainably source liquidity that is readily available for DAOs. Consequently, the product is not dependent on TOKE emissions. This ensures that regardless of any fluctuation in direct DAO demand, all liquidity remains actively deployed, thus benefiting both LPs and Tokemak.\n\nComplementary to this, the DAO Liquidity Marketplace empowers DAOs with the option to deposit incentives to rent liquidity in quasi real-time at a known rate. This deterministic control enables a novel form of liquidity management where DAOs are able to directly define the desired depth across all integrated DEXs. As such, the uncertainty that is associated with indirect incentive mechanisms for third-party LPs is eliminated. This flexibility enables liquidity adjustments that are decoupled from voting rounds, thus allowing LST protocols to reinforce liquidity during events of on-chain liquidations and large validator exit queues.\n\nIn summary, the goal for Tokemak v2 is to create liquidity rates for crucial markets in the DeFi ecosystem through LMPs. By doing so, DAOs are empowered with real-time and deterministic control over liquidity while LPs get open access to a dynamic pool allocator that optimizes returns across all supported venues. Leveraging the existing synergies between both products, the Autopilot constitutes the rational market participant that provides reactive liquidity to integrated DEXs, sourcing both the TVL and discovering the rates that power the Liquidity Marketplace.\n\nNote: A public-facing roadmap can be found on the following Asana board: https://app.asana.com/read-only/Public-Tokemak-V2/1201719920336277/cf9fd05c497a632a8b08fd1f21dd38ba/timeline\n\nTokemak v2 aims to introduce transparent liquidity rates in DeFi, benefiting LPs and DAOs. The Autopilot optimizes LP returns and sources liquidity, while the DAO Liquidity Marketplace offers real-time access to liquidity at a known rate. This synergy powers Tokemak’s goal of discovering liquidity rates for crucial DeFi markets.\n\n┻┳\n\n‍",
    "metadata": {
      "read_time": "12 min read"
    },
    "scraped_at": "2025-10-15T21:14:46Z"
  },
  {
    "url": "https://blog.tokemak.xyz/post/community-call---may-22-2024",
    "title": "Tokemak Blog - Community Call - May 22, 2024",
    "content": "Gitbook V2 release: Great progress is being made on the Gitbook V2 documentation, with the aim to have everything ready before the open launch. The new version will include all Autopilot technical documentation, complete with GIFs to demonstrate how to use and navigate the UI.\nAudit updates & contract redeployments: The second weekly check-in with Hexens has been completed, with no major issues found so far. Since the start of the guarded launch, numerous updates have been made, leading to a full redeployment of contracts on mainnet. While these contracts are not yet in use, they will be switched over in the coming weeks. All funds will be migrated, with potential for new destinations to be added as part of the transition.\nTokemak Autopilot will be on Base: The Base deployment is expected within a week or so, utilizing CCIP from Chainlink to communicate the data required for Autopilot to operate and rebalance.\nPre-launch marketing: Work has begun on creating timelines for content and campaigns, organizing assets, and planning an NFT campaign to be launched on Base. Coordination of launch media coverage and co-marketing efforts with integrated protocols is also underway. Additional content will include podcasts for educational distribution, YouTube explainers, and research articles.\nSplash page updates: The splash page has been updated to more clearly communicate the value of Autopilot to individual users based on feedback from investors and the community.\nAn invitation to engage: We invite everyone to request a call with the team to discuss Autopilot or provide feedback on the new splash page. If you have some thoughts, please get in touch via Discord!\n\n‍\n\nStay tuned for more updates and thank you for your continued support!\n\n┻┳\n\n‍",
    "metadata": {},
    "scraped_at": "2025-10-15T21:14:51Z"
  },
  {
    "url": "https://blog.tokemak.xyz/post/community-call---november-17-2023",
    "title": "Tokemak Blog - Community Call - November 17, 2023",
    "content": "v2 Launch Timing and Security Measures: Tokemak is gearing up for the launch of v2 before the end of November. The team is emphasizing the importance of security, including formal verification processes and thorough internal testing. The alpha launch will follow these rigorous security checks.\nTokenomics and TOKE Value Accrual Strategy: The project's initial phase is centered around increasing the value for TOKE holders. This involves the implementation of the accTOKE mechanism, where TOKE will automatically accrue ETH. The second phase will introduce new functionalities for TOKE, such as an enhanced mechanism for directing liquidity that offers additional benefits.\nEvolution from v1 to v2: The transition from v1 to v2 is described as an evolution, indicating significant upgrades and new features over the previous version.\nV2 Website Interface and User Experience Improvements: The team has been working on the v2 website, which they demoed, highlighting improvements made based on user feedback. These improvements include more intuitive displays of liquidity flow and streamlined deposit and withdrawal processes.\nComprehensive Marketing Strategy for V2 Launch: Tokemak’s marketing efforts for the launch include creating educational and entertaining content like explainer and meme videos. They also plan to collaborate with other protocols and launch a campaign to boost total value locked (TVL) and increase platform visibility.\nAutopilot Feature for Mainnet: The first component of the Autopilot feature is set to be deployed on the mainnet. This involves a statistics smart contract, which is crucial for gathering real-world, on-chain data. This feature is in the testing phase.\nDynamic Liquidity Pool Management (LMPs): The introduction of Liquidity Pool Management (LMPs) is a significant update. It allows for more dynamic allocation of liquidity across different pools. This is expected to improve liquidity provider aggregation and optimize yield generation.\nExpansion of Asset Classes: Tokemak plans to expand the range of assets available on their platform. This expansion will go beyond Ethereum to include stablecoins and governance tokens, offering users a wider variety of options for providing liquidity.\nActive Community Involvement: The update emphasizes the importance of community feedback, especially in relation to the new v2 site and its ongoing development. The team encourages active engagement and suggestions from the community.\n\n‍",
    "metadata": {},
    "scraped_at": "2025-10-15T21:14:57Z"
  },
  {
    "url": "https://blog.tokemak.xyz/post/autopilot",
    "title": "Tokemak Blog - Autopilot",
    "content": "1. Introduction\n\n‍\n\nLiquidity provisioning remains fragmented. While manually providing liquidity, particularly to correlated trading pairs such as ETH LSTs/LRTs and stablecoins, individual liquidity providers (LPs) face a complex decision-making process involving a wide array of pools and DEXs, varying yields, and costs such as gas, slippage, and trading fees.\n\n‍\n\nIn addition to the complexity of rebalancing liquidity, individual LPs are often priced out due to the associated costs, inevitably leading to underperformance. As a result, liquidity remains isolated and stagnant across pools, insensitive to changes in rates unless manual intervention occurs.\n\n‍\n\nAutopilot introduces automated liquidity (autoLP) to DeFi, which connects liquidity that was previously isolated across different pools through autonomous LP rebalances. This novel form of LP aggregation creates reactive liquidity which adapts dynamically to changes in rates. As such, LPs are able to passively outperform individual pools via a configurable set of options - Autopools - while retaining composability across DeFi.\n\n‍\n\n‍\n\n2. Autopilot: LP Aggregation\n\n‍\n\nAutopilot enables a new way to LP through Autopools. These Autopools use the ERC-4626 standard and can be configured with various pools across different DEXs as destinations, thus creating customizable networks of automated liquidity. Once assets are deployed, Autopilot monitors the market, assesses fluctuations in yields taking into account a wide range of metrics, and autonomously rebalances liquidity for long-term LP outperformance.\n\n‍\n\nUsing this approach, gas costs are dramatically reduced, and earnings are auto-compounded into the respective Autopool. Furthermore, users receive a composable receipt token that can be seamlessly integrated across DeFi.\n\n‍\n\nThe user experience for Autopool LPs is simple: deposit ETH and receive autoXYZ. Autopilot will then autonomously rebalance liquidity across the underlying destinations. Using its on-chain verifiable decision-making process, Autopilot ensures transparent rebalance decisions and auditable strategies across a predefined set of assets and destinations. It is important to note that users can withdraw deposited funds at any time with no delays.\n\n‍\n\nFor launch, Autopilot will be live on Ethereum mainnet and Base. The initial focus will be on ETH-denominated Autopools for LSTs and LRTs, with a particular emphasis on incentivizing the distribution of the respective receipt tokens, autoETH and autoLRT. Beyond ETH, the plan is to quickly expand to other asset classes, such as stablecoins. Built with modularity in mind, the architecture allows the integration of new assets and destinations in a seamless plug-and-play manner.\n\n‍\n\nAdditionally, permissionless creation of Autopools will be introduced post-launch. This feature allows any user to create their own Autopool with a customized risk profile and corresponding receipt token. As a result, users have the flexibility to express individual risk preferences, meaning that the free market can determine new pool configurations for Autopools.\n\n‍\n\nUltimately, Autopilot's goal as an LP Aggregator is to replace direct interactions with DEXs, acting as a funnel that routes all deposited liquidity based on market rates. This approach expands the addressable market for liquidity provision to any asset holder seeking passive earnings, while simultaneously enhancing market efficiency and overall liquidity. What DEX aggregators did for traders, Autopilot is doing for LPs.\n\n‍\n\n‍\n\n3. Autopilot: System Overview\n\n‍\n\nThe Autopilot system is designed with the goal of continuously allocating assets deposited into Autopools to destinations with the best risk-return profile. Rewards earned in the process are auto-compounded and redeposited into the respective Autopool. This section outlines a simplified overview of the system and an asset flow example.\n\n‍\n\n3.1. Strategy\n\n‍\n\nThe Strategy contract is responsible for determining if a given liquidity rebalance is in the best interest of an Autopool. To achieve this purpose, Autopilot relies on the Stats System, which is responsible for providing all required signals (e.g., various types of yield) available on-chain. These signals are then stored and processed by “calculators” that are kept up to date through a keeper network.\n\n‍\n\nAmong the strategy’s key features we have the following:\n\n‍\n\nComposite Return Metric - The Composite Return Metric is a score associated with destinations for liquidity within Autopools. This metric breaks down APRs into separate parts. As such, Autopilot has the flexibility of overweighting/underweighting different components for further optimization. A valid rebalance needs to verify an increase in this metric.\n\n‍\n\nAdaptive Rebalance Offset Period - The adaptive rebalance constraint is a gatekeeping condition for rebalances, which states that the expected return associated with a rebalance needs to be recouped over a given period. It is worth noting that this is a self-learning mechanism with a variable cost offset period that adapts to different market environments based on the observed yield volatility.\n\n‍\n\nLastly, several other factors are accounted for in the strategy, such as total slippage (i.e., the total difference in the value of the in and out LP tokens) and lookback tests that verify an increase of the net asset value (NAV) over time.\n\n‍\n\n3.2. Solver\n\n‍\n\nThe Solver is an off-chain component that proposes rebalance solutions to interchangeably convert assets and LP tokens, as well as LP token into other LP tokens. The rebalance solutions are proposed to the Strategy, once they satisfy the Strategy’s imposed constraints, a rebalance takes place.\n\n‍\n\n3.3. Autopilot: Flow of Assets\n\n‍\n\n‍\n\nThe following steps provide a simplified illustration of the flow of assets within Autopilot:\n\n‍\n\nDeposit - User deposits assets into Autopool. After this action, the Autopool has idle assets and the user gets the respective receipt token in return;\n\n‍\n\nRebalance - After a certain threshold of assets is deposited into the Autopool, the Strategy backing it starts to accept proposals from the Solver. Once a proposal satisfies the constraints imposed by the Strategy, the proposed rebalance takes place, and assets are converted into LP tokens;\n\n‍\n\nAuto-compounding - On a periodic basis, rewards from destinations are claimed and collected via a keeper process. These tokens are then converted into the Autopool base asset;\n\n‍\n\nDebt Reporting - Each Autopool goes through a debt reporting during which the system re-values the LP tokens held by an Autopool. During that process, any available auto-compounded rewards are claimed and come into the Autopool as idle funds;\n\n‍\n\nRestart - With sufficient idle assets in the Autopool, another rebalance can occur. While this asset flow primarily focuses on idle-to-LP rebalances, it also applies to LP-to-LP rebalances, provided the proposed move results in a higher potential return and meets additional constraints imposed by the strategy.\n\n‍\n\nIn other words, users deposit assets into Autopools, the stats contracts provide on-chain market information, and the solver proposes rebalances to be validated by the strategy. For a proposed rebalance to be accepted, it must meet the strategy's constraints.\n\n‍\n\n4. Liquid Auto Tokens (LATs) and Permissionless Autopools\n\n‍\n\nLiquid Auto Tokens (LATs) represent yield-bearing Autopool receipt tokens (e.g., autoETH). In essence, LATs are tokenized automated liquidity networks backed by LP positions. Once the permissionless creation of Autopools is live, anyone will be able to launch Autopools with customizable risk profiles and issue the respective LATs. As such, Autopilot becomes a platform where DAOs, risk managers, and individual users can launch Autopools. This permissionless feature allows users to express individual risk preferences, thus letting the free market determine new pool configurations for Autopools.\n\n‍\n\n‍\n\n4.1. DAOs\n\n‍\n\nFor web3 projects, LATs provide a new way to combine utility with distribution. DEXs, asset issuers, and L2s, can customize Autopools with the preferred pool selection. Using the respective LAT, it becomes possible to eliminate the overhead associated with the complexity and monitoring required from LPs, streamlining liquidity provision through a single token. \n\n‍\n\nAs an example, a DEX can select a set of pools (e.g., correlated ETH pairs), create the respective Autopool, and issue its own project branded LAT (e.g., xyzETH). Once set up, the user experience is simple: provide ETH, receive xyzETH, and all the underlying liquidity remains optimally deployed according to market rates, while remaining within the underlying DEX ecosystem. As a result, this DEX ecosystem is now tokenized and can be exported through its own LAT which remains composable across DeFi.\n\n‍\n\nExamples of possible DeFi integrations include utilizing LATs as collateral, integrating LATs into yield marketplaces to trade liquidity rates, and leverage LATs. Through the tokenization of automated liquidity networks, providing liquidity to a set of pools becomes as simple as swapping tokens or making deposits. This approach creates passive yield opportunities for users, which retain all underlying liquidity within a single ecosystem, thus promoting sticky liquidity and broadening the addressable market.\n\n‍\n\n‍\n\n4.2. Risk Managers\n\n‍\n\nAs DeFi evolves, new protocols are moving away from vertically integrated approaches, where a single protocol manages all aspects of a system, toward open and modular models. These models allow different participants to contribute specialized skills.\n\n‍\n\nNew money markets such as Morpho Blue, or modular restaking platforms like Mellow, rely on architectures that allow for the customization of risk profiles by external actors. This allows risk managers to curate new product offerings with different risk-adjusted profiles.\n\n‍\n\nAutopilot is evolving in this direction with the integration of permissionless Autopools in its roadmap. This allows Tokemak to position itself as a platform where specialized risk managers can create customized Autopools with different configurations of pools and parameters, and issue the respective LATs. Through this open approach, Autopilot aims to expand its distribution and cater to specific market segments, such as institutional LPs.\n\n‍\n\n4.3. Individuals\n\n‍\n\nAutopilot's modular approach allows individual users to create custom Autopool configurations when existing options don't meet their risk profiles. Therefore, individuals can define pool compositions and parameters, thus issuing LATs that meet specific user needs.\n\n‍\n\n5. Conclusion\n\n‍\n\nAutopilot creates automated liquidity networks which are customizable and composable. As an LP Aggregator, Autopilot connects liquidity across pools and DEXs thus enabling a new way to LP. It achieves this by monitoring the market using various on-chain signals. These signals are then used to autonomously rebalance assets deposited into Autopools (ERC-4626). As such, Autopools represent automated liquidity networks tokenized through LATs, which can be utilized across DeFi. \n\n‍\n\nFurthermore, Autopilot allows LPs to long-term outperform any constituent pools included in an Autopool. This is achieved while maintaining composability across DeFi through LATs and significantly reducing gas costs for users compared to the current LP experience. By integrating different AMM models in a plug-and-play manner, Autopilot abstracts away one of the core challenges of manual liquidity provision: differentiating between AMM models.\n\n‍\n\nPost-launch, Autopilot will introduce permissionless Autopools. As such, users can create new Autopools and customize risk profiles through the selection of pools and parameters. This open model allows DAOs, risk managers, and individuals to create and curate new risk profiles tailored to different market segments, ranging from retail to institutional LPs. Instead of pursuing a closed vertical approach, Tokemak becomes an open platform enabling external participants to launch Autopools and issue LATs.\n\n‍\n\nIn summary, manual liquidity provision is a market inefficiency solved by Autopilot. Using Autopools, LPs can access automated liquidity networks tokenized through LATs, which remain composable across DeFi. As a platform where anyone can create Autopools, Autopilot allows DAOs, risk managers, and individuals to build customized risk profiles for different LP market segments. For DeFi, the evolution from Tokemak v1 to v2 marks the transition from manual to automated LPing. On Autopilot, liquidity becomes reactive.\n\n‍\n\nAutopilot is currently undergoing a final full system audit - the Guarded Launch, with Tokemak treasury deployed assets, is currently live. Users can already begin earning autoETH by locking TOKE now. When the full system audit concludes, Autopilot will be open to public deposits in the first Autopool.\n\n‍\n\nJoin Tokemak Autopilot's Guarded Launch here.\n\n‍",
    "metadata": {
      "read_time": "8 min read time"
    },
    "scraped_at": "2025-10-15T21:15:02Z"
  }
]